---
kind: property
id: P:Autodesk.Revit.DB.TessellatedShapeBuilder.NumberOfCompletedFaceSets
source: html/aacc351c-0e65-7d1d-c177-627de5e9974a.htm
---
# Autodesk.Revit.DB.TessellatedShapeBuilder.NumberOfCompletedFaceSets Property

Number of completed face sets.

## Syntax (C#)
```csharp
public int NumberOfCompletedFaceSets { get; }
```